[{"door":1,"author":"Hugo Wallenburg","title":"Snug as a Bug","content":"\u003cp\u003ePå den polare prærien er det viktig å holde seg varm om nettene, selv for en barsk kugutt-alv. Alven vår vil sove og leter etter et koselig sted og et godt teppe for natten, men det eneste teppet han finner har en merkelig form. Han prøver alle måter å legge teppet over seg for å dekke så mye som mulig av kroppen sin og samtidig sørge for at de viktigste kroppsdelene er gode og varme og koser seg.\u003c/p\u003e\n\n\u003chr\u003e\n\n\u003cp\u003eI filen \u003ca href=\"https://julekalender-backend.knowit.no/challenges/2024-01/files/joe.txt?disposition=inline\" title=\"\" rel=\"noreferrer noopener\" target=\"_blank\"\u003ejoe.txt\u003c/a\u003e finner du omrisset av kugutt-alven vår, hvor tallene angir hvor godt han liker akkurat den delen av kroppen dekket. Teppet ser slik ut:\u003c/p\u003e\n\n\u003cpre\u003e\u003ccode\u003e xxx\nxxxxx\nxxxxx\nxxxxx\nxxxxx\n  x\nxxxxx\nxxxxx\nxxxxx\nxxxxx\n xxx\n\u003c/code\u003e\u003c/pre\u003e\n\n\u003cp\u003eHva er den høyeste graden av koselighet kugutt-alven vår kan oppnå ved å legge teppet over seg? Koselighetsgraden er summen av koselighets-score for alle deler av kroppen som er dekket. Teppet kan flyttes i x- og y-aksen og roteres 90 grader.\u003c/p\u003e\n","answer":"91"},{"door":2,"author":"Sverre Johann Bjørke","title":"Ekstra interessante primtall","content":"\u003cp\u003eAlvar er er glade i primtal (kven er vel ikkje?!). Primtal med ekstra interessante egenskapar er særleg spanande. Nokon primtal har ein \u003ca href=\"https://www.matematikk.org/oss.html?tid=89233\" title=\"\" rel=\"noreferrer noopener\" target=\"_blank\"\u003etverrsum\u003c/a\u003e som er lik tverrsummen til posisjonen primtallet har i rekka av primtal. Kva er summen av dei 10 000 første slike primtala?\u003c/p\u003e\n","answer":"18857085298"},{"door":3,"author":"Hugo Wallenburg","title":"Pytt i julepanne","content":"\u003cp\u003eAlvefine setter seg ned for å nyte sitt daglige julemåltid. Hun spiser såklart \u003ccode\u003eris\u003c/code\u003e, \u003ccode\u003eerter\u003c/code\u003e, \u003ccode\u003egulrøtter\u003c/code\u003e, \u003ccode\u003ereinsdyrkjøtt\u003c/code\u003e og hennes favoritt: \u003ccode\u003ejulekringle\u003c/code\u003e. Hun ELSKER \u003ccode\u003ejulekringle\u003c/code\u003e, men må spise opp resten av maten før hun kan begynne på den sier Alvemor.\u003c/p\u003e\n\n\u003cp\u003eTallerkenen hennes starter med 100g av hver type mat. Hvert sekund kan hun spise 5g av én type mat og 3g av en annen type mat, prioritert fra venstre i listen. Hun kan kun spise 2g kjøtt om gangen, og hun liker ikke å spise det sammen med noe. Hun får kun lov til å spise 1g julekringle om gangen, og det går såklart heller ikke å spise sammen med noe annet.\u003c/p\u003e\n\n\u003cp\u003eAlvemor fyller på mat etterhvert som Alvefine spiser: Tallene under viser hvor mange gram av en type mat som fylles på hver gang det kommer mer. Når man er gått gjennom lista en gang starter man på nytt i det uendelige. \u003ccode\u003eris\u003c/code\u003e, \u003ccode\u003eerter\u003c/code\u003e og \u003ccode\u003egulrøtter\u003c/code\u003e fylles på hvert sekund.\u003c/p\u003e\n\n\u003cpre\u003e\u003ccode\u003eris: [0, 0, 1, 0, 0, 2]\nerter: [0, 3, 0, 0]\ngulrøtter: [0, 1, 0, 0, 0, 8]\nreinsdyrkjøtt: [100, 80, 40, 20, 10]\njulekringle: -\n\u003c/code\u003e\u003c/pre\u003e\n\n\u003cp\u003eI tillegg er det noen spesielle regler:\u003c/p\u003e\n\n\u003cul\u003e\n\u003cli\u003eGulrøtter begynner ikke med påfyll før etter 30 sekunder.\u003c/li\u003e\n\u003cli\u003eReinsdyrkjøtt fylles ikke på før det er helt tomt, og etter det er tomt går det 50 sekunder før Alvemor kommer med påfyll.\u003c/li\u003e\n\u003cli\u003eDet er ikke mer reinsdyrkjøtt når den opprinnelige listen er ferdig.\u003c/li\u003e\n\u003cli\u003eJulekringle fylles ikke på.\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003chr\u003e\n\n\u003cp\u003eBegynnelsen ser slik ut:\u003c/p\u003e\n\n\u003cul\u003e\n\u003cli\u003e\u003ccode\u003et=0\u003c/code\u003e Alvefine spiser 5g ris og 3g erter. Alvemor fyller på 0g ris og 0g erter, påfyll av gulrøtter har ikke begynt. Det er masse kjøtt, så ingen påfyll begynner.\u003c/li\u003e\n\u003cli\u003e\u003ccode\u003et=1\u003c/code\u003e Alvefine spiser 5g ris og 3g erter. Alvemor fyller på 0g ris og 3g erter.\u003c/li\u003e\n\u003cli\u003e\u003ccode\u003et=2\u003c/code\u003e Alvefine spiser 5g ris og 3g erter. Alvemor fyller på 1g ris og 0g erter.\u003c/li\u003e\n\u003cli\u003e...\u003c/li\u003e\n\u003cli\u003e\u003ccode\u003et=22\u003c/code\u003e Det er tomt for ris. Alvefine spiser 5g erter og 3g gulrøtter.\u003c/li\u003e\n\u003cli\u003e...\u003c/li\u003e\n\u003cli\u003e\u003ccode\u003et=71\u003c/code\u003e Alvefine spiser den første biten med reinsdyrkjøtt.\u003c/li\u003e\n\u003cli\u003e...\u003c/li\u003e\n\u003cli\u003e\u003ccode\u003et=269\u003c/code\u003e Den første biten julekringle treffer endelig munnen!!!\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eHvor mange sekunder tar det Alvefine å spise opp all julekringla mens Alvemor fortsetter å fylle på den andre maten?\u003c/p\u003e\n","answer":"1169"},{"door":4,"author":"Hugo Wallenburg","title":"404 Oppgave Ikke Ferdig","content":"\u003cp\u003eOi vi rakk visst ikke å fullføre denne oppgaven i tide. Jaja, her er et fint bilde av nissen dere kan kose dere med til i morgen:\u003c/p\u003e\n\n\u003cp\u003e\u003cimg src=\"https://julekalender-backend.knowit.no/challenges/2024-04/files/santa.png?disposition=inline\" title=\"\" alt=\"Conspicuous Santa\" /\u003e\u003c/p\u003e\n","answer":"hamar julebrus er helt ok"},{"door":5,"author":"Sander Krøglid","title":"Valg på Nordpolen","content":"\u003cp\u003eDet har akkurat vært valg på Nordpolen. Alvene har stemt på hvilket parti de ønsker skal styre nordpolen og avgjøre julens fremtid.\nKandidatene i årets valg var Kanela Holkis fra partiet Nord, Donisse Tramp fra partiet Julepartiet de Røde, Jule Bukken fra partiet Advent Alveparti og Jul E. Vask fra partiet Motpol.\nDin oppgave er å finne ut av hvem som vant valget!\u003c/p\u003e\n\n\u003cp\u003ePå nordpolen er det 50 stater, og 501 valgnisser fordelt på disse statene. Den kandidaten som har fått flest valgnisser vinner valget.\nValgnissene i hver stat blir fordelt proposjonalt mellom hver kandidat.\u003c/p\u003e\n\n\u003cp\u003eEksempel: En stat med 10 valgnisser med 100 totalt stemmer\u003c/p\u003e\n\n\u003cpre\u003e\u003ccode\u003e+----------+---------+--------------+------------+-------------+-----------+\n| Kandidat | Stemmer | Fordeling VN | VN (floor) |    Rest     | Totalt VN |\n+----------+---------+--------------+------------+-------------+-----------+\n| a        | 8       | 0.8          | 0          | 0.8         | 1         |\n| b        | 23      | 2.3          | 2          | 0.3         | 2         |\n| c        | 49      | 4.9          | 4          | 0.9         | 5         |\n| d        | 20      | 2.0          | 2          | 0.0         | 2         |\n+----------+---------+--------------+------------+-------------+-----------+\n|          | 100     | 10           | 8          | 2           | 10        |\n+----------+---------+--------------+------------+-------------+-----------+\n\u003c/code\u003e\u003c/pre\u003e\n\n\u003cp\u003eValgnissene blir fordelt ved å dele antall kandidatstemmer med totalt antall stemmer i staten og gange opp med antall valgnisser i staten. Dette tallet blir rundet ned og vi vil få en foreløpig fordeling av valgnisser. I eksempelet ser vi at valgnissefordelingen mangler to nisser, og disse må bli fordelt på kandidatene. Kandidat \u003ccode\u003ec\u003c/code\u003e har størst \u003ccode\u003erest\u003c/code\u003e og dermed størst krav på en ekstra valgnisse, så \u003ccode\u003ec\u003c/code\u003e får en av de resterende valgnissene. Siden det fortsatt er én valgnisse igjen, vil kandidat \u003ccode\u003ea\u003c/code\u003e med nest størst rest også få en valgnisse. Dersom det er uavgjort hvem som har størst krav på en resterende valgnisse går den til kandidaten med lavest id.\u003c/p\u003e\n\n\u003cp\u003eListen over kandidater \u003ca href=\"https://julekalender-backend.knowit.no/challenges/2024-05/files/kandidater.txt?disposition=inline\" title=\"\" rel=\"noreferrer noopener\" target=\"_blank\"\u003ekandidater.txt\u003c/a\u003e\u003c/p\u003e\n\n\u003cp\u003eListen over stater, antall valgnisser og stemmer finner du i filen \u003ca href=\"https://julekalender-backend.knowit.no/challenges/2024-05/files/stater.txt?disposition=inline\" title=\"\" rel=\"noreferrer noopener\" target=\"_blank\"\u003estater.txt\u003c/a\u003e\u003c/p\u003e\n\n\u003cp\u003eHvem vant? Svaret skal skrives på formen \u003ccode\u003eX - Y\u003c/code\u003e, hvor X er kandidatens fulle navn, og Y er totalt antall valgnisser hen fikk. Eks. \u003ccode\u003eJule Bukken - 501\u003c/code\u003e\u003c/p\u003e\n","answer":"donisse tramp - 131"},{"door":6,"author":"Hugo Wallenburg","title":"Gaveteller sabotasje","content":"\u003cp\u003eI nissens verksteder er det gigantiske sett med \u003ca href=\"https://en.wikipedia.org/wiki/Seven-segment_display\" title=\"\" rel=\"noreferrer noopener\" target=\"_blank\"\u003e7-segmentdisplayer\u003c/a\u003e som viser hvor mange pakker de har laget til årets jul. Hvert verksted har ansvar for opp til \u003ccode\u003e999 999 999\u003c/code\u003e pakker, så displayene kan vise tall opp til \u003ccode\u003e999 999 999\u003c/code\u003e. Displayene er dermed satt sammen av 9 7-segmentdisplayer. Tallene vises i dette formatet:\u003c/p\u003e\n\n\u003cpre\u003e\u003ccode\u003e+--+     +  +--+  +--+  +  +  +--+  +--+  +--+  +--+  +--+\n|  |     |     |     |  |  |  |     |        |  |  |  |  |\n|  |     |     |     |  |  |  |     |        |  |  |  |  |\n+  +     +  +--+  +--+  +--+  +--+  +--+     +  +--+  +--+\n|  |     |  |        |     |     |  |  |     |  |  |     |\n|  |     |  |        |     |     |  |  |     |  |  |     |\n+--+     +  +--+  +--+     +  +--+  +--+     +  +--+  +--+\n\u003c/code\u003e\u003c/pre\u003e\n\n\u003cp\u003eUbrukte displayer viser \u003ccode\u003e0\u003c/code\u003e dersom tallet som skal vises er lite nok til å ikke trenge alle displayenene. F.eks. vises \u003ccode\u003e1024\u003c/code\u003e som \u003ccode\u003e000001024\u003c/code\u003e.\u003c/p\u003e\n\n\u003cp\u003eHvert sifferdisplay er addressert \u003ccode\u003eABC...\u003c/code\u003e fra høyre (lavere siffer) og hvert 7-segmentdisplay addresseres slik:\u003c/p\u003e\n\n\u003cpre\u003e\u003ccode\u003e   A\n   _\n\nF|   |B\n   _\n   G\nE|   |C\n   _\n   D\n\u003c/code\u003e\u003c/pre\u003e\n\n\u003cp\u003eAdressen \u003ccode\u003eDC\u003c/code\u003e addresserer altså segment \u003ccode\u003eC\u003c/code\u003e i display \u003ccode\u003eD\u003c/code\u003e (tusenplassen).\u003c/p\u003e\n\n\u003cp\u003eGrinchen har i jul igjen tuklet med displayet slik at det viser feil tall. Han har byttet om på ledninger mellom noen av segmentene slik at de viser feil. Dette er \u003cem\u003ekritisk infrastruktur\u003c/em\u003e og du må hjelpe til med debuggingen. Følgende segmenter har byttet plass i addresseringen:\u003c/p\u003e\n\n\u003cpre\u003e\u003ccode\u003eAC \u0026lt;-\u0026gt; IB\nBD \u0026lt;-\u0026gt; EG\nGF \u0026lt;-\u0026gt; DE\nBA \u0026lt;-\u0026gt; BB\n\u003c/code\u003e\u003c/pre\u003e\n\n\u003cp\u003eHvor mange av tallene displayet kan vise er de samme selv etter Grinchens tukling?\u003c/p\u003e\n","answer":"134976000"},{"door":7,"author":"Hugo Wallenburg","title":"Jule-3-tall","content":"\u003cp\u003eLystige juletall er tall hvor du gjentatte ganger tar summen av kvadratene til sifrene i tallet og til slutt ender opp med bare 1. For eksempel er 19 et lystig juletall fordi 1\u003csup\u003e2\u003c/sup\u003e + 9\u003csup\u003e2\u003c/sup\u003e = 82, 8\u003csup\u003e2\u003c/sup\u003e + 2\u003csup\u003e2\u003c/sup\u003e = 68, 6\u003csup\u003e2\u003c/sup\u003e + 8\u003csup\u003e2\u003c/sup\u003e = 100, 1\u003csup\u003e2\u003c/sup\u003e + 0\u003csup\u003e2\u003c/sup\u003e + 0\u003csup\u003e2\u003c/sup\u003e = 1. Vi sier også at 0 er et lystig juletall.\u003c/p\u003e\n\n\u003cp\u003eDessverre er ikke disse tallene julete nok til å bestemme hvor mange lys de skal henge på treet på Nordpolen, for fy flate der skal himmelen lyse opp! Alvene pønsker ut en type Jule-3-tall som kan bestemme antall lys på treet deres:\u003c/p\u003e\n\n\u003cp\u003eEt tall er et jule-3-tall dersom det er et lystig juletall OG tallets første halvdel av sifre er et lystig juletall OG tallets siste halvdel av sifre er et lystig juletall (dersom tallet har et odde antall sifre inkluderes ikke det midterste tallet) OG alle tallets 3 påfølgende sifre satt sammen er lystige juletall.\u003c/p\u003e\n\n\u003cp\u003eEksempler:\u003c/p\u003e\n\n\u003cul\u003e\n\u003cli\u003e1 er åpenbart et jule-3-tall\u003c/li\u003e\n\u003cli\u003e7 er et jule-3-tall fordi det er et lystig juletall (7\u003csup\u003e2\u003c/sup\u003e = 49, 4\u003csup\u003e2\u003c/sup\u003e + 9\u003csup\u003e2\u003c/sup\u003e = 97, 9\u003csup\u003e2\u003c/sup\u003e + 7\u003csup\u003e2\u003c/sup\u003e = 130, 1\u003csup\u003e2\u003c/sup\u003e + 3\u003csup\u003e2\u003c/sup\u003e + 0\u003csup\u003e2\u003c/sup\u003e = 10, 1\u003csup\u003e2\u003c/sup\u003e + 0\u003csup\u003e2\u003c/sup\u003e = 1) og det er ikke nok sifre til at noen av de andre reglene slår inn.\u003c/li\u003e\n\u003cli\u003e70 er et jule-3-tall fordi det er et lystig juletall (7\u003csup\u003e2\u003c/sup\u003e + 0\u003csup\u003e2\u003c/sup\u003e = 49, 4\u003csup\u003e2\u003c/sup\u003e + 9\u003csup\u003e2\u003c/sup\u003e = 97, 9\u003csup\u003e2\u003c/sup\u003e + 7\u003csup\u003e2\u003c/sup\u003e = 130, 1\u003csup\u003e2\u003c/sup\u003e + 3\u003csup\u003e2\u003c/sup\u003e + 0\u003csup\u003e2\u003c/sup\u003e = 10, 1\u003csup\u003e2\u003c/sup\u003e + 0\u003csup\u003e2\u003c/sup\u003e = 1), og samtidig er tallets første halvdel av sifre (bare \u003ccode\u003e7\u003c/code\u003e) et lystig juletall og tallets siste halvdel av sifre (bare \u003ccode\u003e0\u003c/code\u003e) et lystig juletall. Det er ikke nok sifre til at regelen om 3 påfølgende sifre slår inn.\u003c/li\u003e\n\u003cli\u003e3100 er et jule-3-tall fordi det er et lystig juletall (3\u003csup\u003e2\u003c/sup\u003e + 1\u003csup\u003e2\u003c/sup\u003e + 0\u003csup\u003e2\u003c/sup\u003e + 0\u003csup\u003e2\u003c/sup\u003e = 10, 1\u003csup\u003e2\u003c/sup\u003e + 0\u003csup\u003e2\u003c/sup\u003e = 1) og samtidig er tallets første halvdel av sifre (\u003ccode\u003e31\u003c/code\u003e) et lystig juletall og tallets siste halvdel av sifre (\u003ccode\u003e00\u003c/code\u003e) et lystig juletall og til slutt er 3-kombinasjonene \u003ccode\u003e310\u003c/code\u003e og \u003ccode\u003e100\u003c/code\u003e også lystige juletall.\u003c/li\u003e\n\u003cli\u003e13023 er et jule-3-tall fordi det er et lystig juletall (1\u003csup\u003e2\u003c/sup\u003e + 3\u003csup\u003e2\u003c/sup\u003e + 0\u003csup\u003e2\u003c/sup\u003e + 2\u003csup\u003e2\u003c/sup\u003e + 3\u003csup\u003e2\u003c/sup\u003e = 23, 2\u003csup\u003e2\u003c/sup\u003e + 3\u003csup\u003e2\u003c/sup\u003e = 13, 1\u003csup\u003e2\u003c/sup\u003e + 3\u003csup\u003e2\u003c/sup\u003e = 10, 1\u003csup\u003e2\u003c/sup\u003e + 0\u003csup\u003e2\u003c/sup\u003e = 1) og \u003ccode\u003e13\u003c/code\u003e er et lystig juletall og \u003ccode\u003e23\u003c/code\u003e er et lystig juletall og \u003ccode\u003e130\u003c/code\u003e, \u003ccode\u003e302\u003c/code\u003e og \u003ccode\u003e023\u003c/code\u003e er lystige juletall.\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eNissen ønsker seg minst noen millioner lys på treet sitt. Hva er det største jule-3-tallet under \u003ccode\u003e10 000 000\u003c/code\u003e?\u003c/p\u003e\n","answer":"9739133"},{"door":8,"author":"Hugo Wallenburg","title":"Perfekte primtalv","content":"\u003cp\u003eAlva Lovelace mener det er på høy tid at alvene kommer med sitt bidrag til matematikken og definerer to nye avanserte typer tall: \u003cem\u003eprimtalv\u003c/em\u003e og \u003cem\u003eperfekte primtalv\u003c/em\u003e. De er definert som følger:\u003c/p\u003e\n\n\u003cp\u003eFor \u003cem\u003eprimtalv\u003c/em\u003e \u003ccode\u003en\u003c/code\u003e, ta de \u003ccode\u003en\u003c/code\u003e første primtallene og skriv dem under hverandre fra venstre. Summer sifrene langs kolonnene, multipliser summene med \u003ccode\u003e1\u003c/code\u003e for kolonne 1, \u003ccode\u003e10\u003c/code\u003e for kolonne 2, \u003ccode\u003e100\u003c/code\u003e for kolonne 3 etc. og til slutt summer disse produktene.\u003c/p\u003e\n\n\u003cp\u003eBeregningen av primtalv \u003ccode\u003en=5\u003c/code\u003e og \u003ccode\u003en=27\u003c/code\u003e ser slik ut:\u003c/p\u003e\n\n\u003cpre\u003e\u003ccode\u003e      n=5       |          n=27\n                |\n                |     2\n                |    +3\n                |    +5\n                |    +7\n  2             |    +1      1\n+ 3             |    +1     +3\n+ 5             |   ...    ...\n+ 7             |    +1     +0     +1\n+ 1     1       |    +1     +0     +3\n =      =       |     =      =      =\n 18     1       |   113    103      4\n* 1   *10       |  *  1   * 10   *100\n  =     =       |     =      =      =\n 18  + 10 = 28  |   113 + 1030  + 400 = 1543\n\u003c/code\u003e\u003c/pre\u003e\n\n\u003cp\u003ePrimtalv \u003ccode\u003e5\u003c/code\u003e er \u003ccode\u003e28\u003c/code\u003e og primtalv \u003ccode\u003e27\u003c/code\u003e er \u003ccode\u003e1543\u003c/code\u003e.\u003c/p\u003e\n\n\u003cp\u003eHvis et primtalv også er et vanlig primtall kaller vi det et \u003cem\u003eperfekt primtalv\u003c/em\u003e. \u003ccode\u003e28\u003c/code\u003e er et primtalv, men det er ikke et primtall så det er ikke et \u003cem\u003eperfekt primtalv\u003c/em\u003e. \u003ccode\u003e1543\u003c/code\u003e er et \u003cem\u003eperfekt primtalv\u003c/em\u003e fordi det er et primtalv og også et vanlig primtall.\u003c/p\u003e\n\n\u003cp\u003eHvor mange \u003cem\u003eperfekte primtalv\u003c/em\u003e finnes det som er lavere enn \u003ccode\u003e10 000 000\u003c/code\u003e?\u003c/p\u003e\n","answer":"111"},{"door":9,"author":"Gaute Rauboti","title":"Væralven","content":"\u003cp\u003eProfessor Alvfred Hveet-Juhl er en viktig alv på Nordpolen. Han er sjefsalv for forskning på vær og vind, og mye av æren er hans for at det alltid er hvit jul. Han bruker store deler av sin tid på å kartlegge snø.\u003c/p\u003e\n\n\u003cp\u003eHan er veldig god til å telle. Kanskje for god. Han teller nemlig tagger på snøfnugg, ikke snøfnuggene selv. Så når Nisseinstituttet skal rapportere til Nissen, må de alltid dele på 6 først (alle snøfnugg har 6 tagger).\nMen så er han kanskje ikke like flink til å loggføre. For der mange (kanskje de fleste) ville skrevet 12, 6 eller 24, skriver Professor Alvfred tolv, seks eller tjuefire. Derfor har Nisseinstituttet et program hvor de mater inn tallene først, slik at det kan omgjøres til tall, før de deler på 6 og rapporterer til Nissen.\u003c/p\u003e\n\n\u003cp\u003eMaskinen som driver dette programmet går vanligvis på reinsdyrkraft, men i dag har de støtt på noen problemer: Dasher har snublet og tråkket over, Dancer har fått discofeber, Prancer har dårlig rygg, Vixen nyser glitter etter å ha overdekorert seg selv, Cupid er kjærlighetssyk, Comet er solbrent, Donner har sovet dårlig over tid pga egen snorking, Blitzen har for mye statisk elektrisitet og risikerer å kortslutte maskina istedet, og Rudolf er forkjøla. Alle har fått streng ordre om å hvile av Nissen slik at de er i form igjen til Julaften.\u003c/p\u003e\n\n\u003cp\u003eMed maskinen ute av drift må du hjelpe Nisseinstituttet! Kan du telle taggene i \u003ca href=\"https://julekalender-backend.knowit.no/challenges/2024-09/files/tall.txt?disposition=inline\" title=\"\" rel=\"noreferrer noopener\" target=\"_blank\"\u003edenne fila\u003c/a\u003e og rapportere antall snøfnugg til nissen?\u003c/p\u003e\n\u003ch2\u003eOpplysninger\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003eAlle tall er under 100\u003c/li\u003e\n\u003cli\u003eSiden alle snøfnugg har 6 tagger, er alle noterte tall delelige med seks. Det vil derfor f.eks. si at \u003ccode\u003esekstiseks\u003c/code\u003e skal være \u003ccode\u003e60 + 6\u003c/code\u003e, ikke \u003ccode\u003e6 + 10 + 6\u003c/code\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003ch2\u003eEksempel\u003c/h2\u003e\n\u003cul\u003e\n\u003cli\u003e\u003ccode\u003esekstjuefire\u003c/code\u003e -\u0026gt; \u003ccode\u003e[6, 24]\u003c/code\u003e -\u0026gt; \u003ccode\u003e30\u003c/code\u003e. Dvs, 5 snøfnugg.\u003c/li\u003e\n\u003c/ul\u003e\n","answer":"26510"},{"door":10,"author":"Hugo Wallenburg","title":"Snug as a Bug in a Rug","content":"\u003cp\u003eSom vi alle vet, så er det på den polare prærien viktig å holde seg varm om nettene, selv for en barsk kugutt-alv. Alven vår vil sove og leter etter et koselig sted å legge seg for natten i sitt koseligste teppe. Han har endelig funnet hatten sin, men har på sin ferd fått noen sår også. Det skal ikke ødelegge for en koselig natts søvn!\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003eÅnei!\u003c/em\u003e\u003c/strong\u003e Teppet er fullt av hull 😱😔?!?! I distansen høres lyden av djevelsk kakling. Rottene har vært på ferde igjen.\u003c/p\u003e\n\n\u003cp\u003eTross motgangen trenger kugutt-alven fortsatt nattesøvnen sin, så han samler alt han har av mot og prøver alle mulige måter å legge teppet over seg slik at de viktigste kroppsdelene er gode og varme og koser seg.\u003c/p\u003e\n\n\u003chr\u003e\n\n\u003cp\u003eI filen \u003ca href=\"https://julekalender-backend.knowit.no/challenges/2024-10/files/joe.txt?disposition=inline\" title=\"\" rel=\"noreferrer noopener\" target=\"_blank\"\u003ejoe.txt\u003c/a\u003e finner du omrisset av kugutt-alven vår, hvor tallene angir hvor godt han liker akkurat den delen av kroppen dekket. Sårene hans er markert med \u003ccode\u003ex\u003c/code\u003e, disse ønsker han helst ikke at teppet rører, følgelig gir de \u003ccode\u003e-2\u003c/code\u003e koselighet. Teppet leses fra filen \u003ca href=\"https://julekalender-backend.knowit.no/challenges/2024-10/files/teppe.txt?disposition=inline\" title=\"\" rel=\"noreferrer noopener\" target=\"_blank\"\u003eteppe.txt\u003c/a\u003e hvor tallene bestemmer hvor koselig hver rute av teppet er (han har nemlig lappet litt med ekstra koselig ull underveis).\u003c/p\u003e\n\n\u003cp\u003eHva er den høyeste graden av koselighet kugutt-alven vår kan oppnå ved å legge teppet over seg? Koselighetsgraden er summen av koselighets-score for alle deler av kroppen som er dekket ganget med koselighets-score for den delen av teppet som dekker akkurat der. Teppet kan flyttes, speiles og roteres i 90-graders inkrementer.\u003c/p\u003e\n","answer":"114"},{"door":11,"author":"Hugo Wallenburg","title":"Klatrealven","content":"\u003cp\u003eDen verdenskjent klatrealven Malvus Halvsnø slo som kjent nylig verdensrekorden i 100m klatring på Sydpolen. Sydpol-alvene var absolutt fascinerte av hans unike klatrestil. I intervjuet etter bragden forklarte han seg:\u003c/p\u003e\n\n\u003cblockquote\u003e\n\u003cp\u003eMalvus:\nJo du ser altså at liksom det er bare atte å liksom ta det ene grepet etter det andre og så aldri se seg tilbake, alltid klatre oppover.\u003c/p\u003e\n\n\u003cp\u003ePing Vin, Sydpolen Tidene:\nMen hva om du klatrer feil og så må snu og ta en annen vei?\u003c/p\u003e\n\n\u003cp\u003eMalvus:\nNei, det gjør jeg ikke. Hvert grep er nøye planlagt, så jeg klatrer aldri feil og aldri nedover. Er det sånn dere gjør på Sydpolen?\u003c/p\u003e\n\n\u003cp\u003ePing Vin, Sydpolen Tidene:\nNei, vi klatrer ikke på Sydpolen. Vi er halvt pingvin.\nHva er så hemmeligheten din for å alltid klatre oppover?\u003c/p\u003e\n\n\u003cp\u003eMalvus:\nJeg har en super alveklatreformel som jeg alltid følger. Den dreier seg om at jeg alltid tar et høyre grep og så et venstre grep og så et høyre grep igjen og så et venstre grep igjen... med unntak av det første da såklart, da velger jeg det som gir med den korteste ruten. Det er formelen bak min enorme internasjonale suksess. Hvorfor ingen andre har tenkt på det før meg får vi nok aldri vite.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\u003cp\u003eMalvus kan strekke seg slik med hver arm:\u003c/p\u003e\n\n\u003cpre\u003e\u003ccode\u003e Venstre         | Høyre\n        xxx      |      xxx\n      xxxxxxx    |    xxxxxxx\n     xxxxxxxxx   |   xxxxxxxxx\n    xxxxxxxxxxx  |  xxxxxxxxxxx\n   xxxxxxxxxxxx  |  xxxxxxxxxxxx\n  xxxxxxxxxxxxx  |  xxxxxxxxxxxxx\n  xxxxxxxxxxxxx  |  xxxxxxxxxxxxx\n xxxxxxxxxxxxx   |   xxxxxxxxxxxxx\n xxxxxxxxxxxx    |    xxxxxxxxxxxx\n          o      |      o\n\u003c/code\u003e\u003c/pre\u003e\n\n\u003cp\u003eDiagrammet over beskriver hvordan Malvus \u003ccode\u003eo\u003c/code\u003e kan strekke seg \u003ccode\u003ex\u003c/code\u003e med venstre eller høyre arm i klatrepunktene gitt ved \u003ca href=\"https://julekalender-backend.knowit.no/challenges/2024-11/files/grep.txt?disposition=inline\" title=\"\" rel=\"noreferrer noopener\" target=\"_blank\"\u003edenne filen med grep \u003ccode\u003ey, x\u003c/code\u003e\u003c/a\u003e. Han startet på \u003ccode\u003e0, 250\u003c/code\u003e og sluttet på \u003ccode\u003e999, 749\u003c/code\u003e i sin verdensrekord. Han tok den korteste ruten (euklidsk distanse). Hvor lang var ruten han tok? Hver enhet i koordinatsystemet tilsvarer 10 cm. Oppgi svar i cm rundet ned til nærmeste hele.\u003c/p\u003e\n","answer":"13282"},{"door":12,"author":"Sander Krøglid","title":"Reisen til julekernelen","content":"\u003cp\u003eGave og innovasjonsteamet er en institusjon som drives jevnt og trutt hele året på nordpolen. Formålet er å finne på gaveideer som kan bli satt i produksjon og bli levert til alle barna når julekvelden ankommer. Det er i stor grad alven Finn Gavesen som har ansvar for dette.\u003c/p\u003e\n\n\u003cp\u003eDa viruset Goro-na nådde Nordpolen, ble det umulig for Finns kreative team å samles for å diskutere gaveideer. I stedet fant Finn på den smarte løsningen å bruke Google for å finne gaveforslag og lagre nettsidene som bokmerker i nettleseren. Som en effektiv person foretrekker Finn å jobbe på Arctic Linux, men dette har skapt utfordringer når nye kernel-oppdateringer slippes. Finn insisterer på å oppdatere straks en ny versjon lanseres, noe som skjer hver søndag. Dessverre opplever han problemer med hver tredje oppdatering, som krever en hel dag med feilsøking og forhindrer ham fra å lagre bokmerker den dagen.\u003c/p\u003e\n\n\u003cp\u003eI adventstiden, når julestrida er på sitt verste, oppstår det problemer hver søndag. Det samme gjelder søndagene i juli. Heldigvis venter det to problemfrie oppdateringer etter advent og juli, da det igjen oppstår problemer for hver tredje oppdatering, som før.\u003c/p\u003e\n\n\u003cp\u003eDagen etter at maskinen er fikset, er Finn så utmattet etter all feilsøkingen at han knapt får gjort noe. Den dagen klarer han bare å lagre ett eneste bokmerke. Men med hver ny dag uten feilsøking, blir han stadig mer ivrig og effektiv. For hver dag som går, klarer han å lagre like mange bokmerker som han gjorde de to foregående dagene til sammen.\u003c/p\u003e\n\n\u003cp\u003eFinn startet med å lagre ett bokmerke 1. april 2020, og fikk første problem søndag 19. april.\nHvor mange bokmerker har Finn klart å lagre innen utgangen av lukens dato (12. desember 2024)?\u003c/p\u003e\n","answer":"1212949"},{"door":13,"author":"Gaute Rauboti","title":"Handlealven","content":"\u003cp\u003eDen nordpolske toppserien i fotball er ikke så stor. Den består kun av 7 lag, som til gjengjeld spiller mot hverandre 20 ganger iløpet av en sesong (februar til november). Det som kanskje skiller denne toppserien fra andre toppserier, er måten spillerlønning håndteres på:\u003c/p\u003e\n\n\u003cul\u003e\n\u003cli\u003eAlle spillere mottar en flat bonus på 100,- per minutt de spiller\u003c/li\u003e\n\u003cli\u003eSummen er deretter gjenstand for en multiplikator som avhenger av flere faktorer:\n\n\u003cul\u003e\n\u003cli\u003eHvis laget scorer mål får alle spillere +5%, men hvis laget slipper inn får de -5%.\u003c/li\u003e\n\u003cli\u003eEksempel: Hvis resultatet blir 3-2, så tjener de +5% (5+5+5-5-5).\u003c/li\u003e\n\u003cli\u003eDen som får assist på målet (A) får +6% i stedet for 5%, og de som scorer målet (S) får +7% i stedet for 5%\u003c/li\u003e\n\u003cli\u003eEksempel: Hvis resultatet blir 3-2, hvor man også scorer det ene målet, så tjener de +7% (7+5+5-5-5).\u003c/li\u003e\n\u003cli\u003eOm man blir kåret til banens beste (B), får man 2% ekstra.\u003c/li\u003e\n\u003cli\u003eHvert lag man møter har også en egen multiplikator tilknyttet seg, som indikerer vanskelighetsgrad. Denne legges til dersom man vinner, og trekkes fra dersom man taper\u003c/li\u003e\n\u003cli\u003eHvis man taper en kamp gis et ekstra insentiv på 3% for neste seier, for å motivere spillerne. Insentivet øker med 1% for hvert tap helt til man vinner. Da legges insentivet til resten av modifikatorene, før den settes tilbake til 0. Uavgjort viderefører insentivet uten å øke det.\u003c/li\u003e\n\u003cli\u003eEksempel: Hvis laget taper 3 kamper på rad, og vinner nr 4, vil det ikke bety noe ekstra i første, andre eller tredje kamp. Men fjerde kamp får man +5% (3+1+1).\u003c/li\u003e\n\u003cli\u003eAlle disse variablene summeres sammen til et negativt eller positivt tall (eller null). Summen av disse tallene utgjøre en prosentsatsen som brukes til å moderere \u0026quot;minuttlønna\u0026quot; (se eksempel).\u003c/li\u003e\n\u003c/ul\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eVanskelighetsmultiplikator:\u003c/p\u003e\n\n\u003cul\u003e\n\u003cli\u003eFC Snøbenhavn (FCB): 1 %\u003c/li\u003e\n\u003cli\u003eJulventus (J): 2 %\u003c/li\u003e\n\u003cli\u003eNisswich Town (NT): 1 %\u003c/li\u003e\n\u003cli\u003eNorthingham Forest (NF): 1 %\u003c/li\u003e\n\u003cli\u003eReinchester City (RC): 3 %\u003c/li\u003e\n\u003cli\u003eSnøkrystall Palace (SP): 2 %\u003c/li\u003e\n\u003cli\u003eVinter Milan (VM): 3 %\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eEtter endt sesong gleder Alvin Braut Fortann seg til julehandelen. Han spiller for Reinchester City, som har gjort det bra. Men han har ikke hatt så god oversikt over spillerlønningen sin; den har faren hans Alv Inge, tatt seg av. Og nå vil han gjerne vite hva han har tjent iløpet av året, slik at han veit hvor dyre gaver han kan kjøpe til venner og familie. Alv Inge har sendt han \u003ca href=\"https://julekalender-backend.knowit.no/challenges/2024-13/files/salary.txt?disposition=inline\" title=\"\" rel=\"noreferrer noopener\" target=\"_blank\"\u003edenne filen\u003c/a\u003e for å finne ut av det. Hvor mye penger har Alvin til å handle julegaver for?\u003c/p\u003e\n\u003ch2\u003eEksempel\u003c/h2\u003e\n\u003cp\u003eInntjening for 1 spiller i 1 kamp er gitt ved en streng på følgende format: \u003ccode\u003eJ/65/B/2-1/AB\u003c/code\u003e. Dette betyr:\u003c/p\u003e\n\n\u003cul\u003e\n\u003cli\u003e\u003ccode\u003eJ\u003c/code\u003e betyr at man har møtt Julventus\u003c/li\u003e\n\u003cli\u003e\u003ccode\u003e65\u003c/code\u003e betyr at man har spilt 65 minutter\u003c/li\u003e\n\u003cli\u003e\u003ccode\u003eB\u003c/code\u003e betyr at man har vært bortelag (H for hjemme)\u003c/li\u003e\n\u003cli\u003e\u003ccode\u003e2-1\u003c/code\u003e betyr at hjemmelaget har scoret 2 ganger, og bortelaget 1 gang. Hjemmelaget har vunnet.\u003c/li\u003e\n\u003cli\u003e\u003ccode\u003eAB\u003c/code\u003e betyr at spilleren har fått 1 assist og blitt kåret til banens beste\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eDe 65 minuttene gir brutto 6500 før modifikatoren regnes ut slik: \u003ccode\u003e-2\u003c/code\u003e for laget (man var bortelag, og tapte, og mister derfor lagmodifikatoren), \u003ccode\u003e-5\u003c/code\u003e for hvert av målene man slapp inn, \u003ccode\u003e+6\u003c/code\u003e for målet man scoret, fordi man hadde assist på det, og \u003ccode\u003e+2\u003c/code\u003e for å bli kåret til banens beste, altså \u003ccode\u003e-2-5-5+6+2=-4%\u003c/code\u003e\u003c/p\u003e\n\n\u003cp\u003eSummen spilleren tjener blir dermed 6500 * 0.96 = 6240,-\u003c/p\u003e\n","answer":"842596"},{"door":14,"author":"Hugo Wallenburg","title":"Vinterpressen","content":"\u003cp\u003eI Nissens nye gavepapir- og adresse-presse er det et fryktelig trykk før julaften, og nå ser det ut som de holder på å gå tom for sifre! For å undersøke problemet bestemmer de seg for å printe ut hvor mange sifre det er igjen.\u003c/p\u003e\n\n\u003cp\u003eÅnei! En evig løkke!! Det viser seg såklart at for å printe ut sifre kreves det også sifre.\u003c/p\u003e\n\n\u003cp\u003eDa de startet tellingen var det 100 000 av hvert siffer 0-9 igjen. Printingen de gjør for å telle starter slik:\u003c/p\u003e\n\n\u003cpre\u003e\u003ccode\u003eDet er 100 000 9-ere igjen, det er 100 000 8-ere igjen, det er 100 000 7-ere igjen, det er 100 000 6-ere igjen, det er 100 000 5-ere igjen, det er 100 000 4-ere igjen, det er 100 000 3-ere igjen, det er 100 000 2-ere igjen, det er 99 992 1-ere igjen, det er 99 960 0-ere igjen.\nDet er 99992 9-ere igjen, det er 99999 8-ere igjen, det er 99999 7-ere igjen, det er 99998 6-ere igjen, det er 99999 5-ere igjen, det er 99999 4-ere igjen, det er 99999 3-ere igjen, det er 99997 2-ere igjen, det er 99991 1-ere igjen, det er 99958 0-ere igjen.\nosv.\n\u003c/code\u003e\u003c/pre\u003e\n\n\u003cp\u003eSifre regnes som brukt opp det øyeblikket vi er ferdige med å printe et fullstendig tall. I eksempelet over er det allerede brukt \u003ccode\u003e8\u003c/code\u003e \u003ccode\u003e1\u003c/code\u003e-ere i det vi er klare til å printe hvor mange \u003ccode\u003e1\u003c/code\u003e-ere det er igjen. Når vi deretter kommer til å printe \u003ccode\u003e0\u003c/code\u003e-ere (fortsatt på første linje) har vi allerede brukt \u003ccode\u003e40\u003c/code\u003e \u003ccode\u003e0\u003c/code\u003e-ere. Etter å ha printet ut resterende antall \u003ccode\u003e0\u003c/code\u003e-er er linjen ferdig.\u003c/p\u003e\n\n\u003cp\u003eNår det er tomt for et siffer står det bare \u003ccode\u003edet er 0 \u0026lt;x\u0026gt;-ere igjen\u003c/code\u003e for alltid. Nissens magi sørger for at det er nok magiske sifre tilgjengelig til å printe det som trengs underveis, men når alle sifre er helt helt helt tomme strekker dessverre ikke nissemagien til og printingen stopper etter den linjen hvor det gikk helt tomt.\u003c/p\u003e\n\n\u003cp\u003eHvor mange linjer ble printet før vi gikk helt helt helt tom for alle sifre, og i hvilken rekkefølge gikk sifrene tomme? Oppgi svar som \u003ccode\u003e\u0026lt;linjer\u0026gt; \u0026lt;x1\u0026gt;,\u0026lt;x2\u0026gt;,...\u0026lt;x3\u0026gt;\u003c/code\u003e, f.eks. \u003ccode\u003e1234 1,2,3,4,5,6,7,8,9\u003c/code\u003e.\u003c/p\u003e\n","answer":"18584 9,2,8,1,3,4,6,7,5,0"},{"door":15,"author":"Hugo Wallenburg","title":"Nye gamle juletall ULLLJ33IV","content":"\u003cp\u003eDa Nissens alver skulle grave ut en ny snødump for å lage påbygg på Nordpolens nissebank oppdaget de en romersk ruin. Hvem visste at romerne hadde besøkt Nordpolen?? Blant artifaktene de fant var en komplett eldgammel liste med transaksjoner fra oldtidens romerske nissebank. Tallene er ikke til å forstå og listen er full av hull fra snømus og flekker fra julegarum, men det er i hvert fall åpenbart at de gamle Nordpol-romerne hadde laget seg et helt unikt tallsystem.\u003c/p\u003e\n\n\u003cp\u003eMed hjelp av alle Nordpolens alvearkeologer og Nissens råd for Romerstudier og med litt god hjelp fra AlvGPT fant de ut av hvordan tallene fungerer. Bankalvene er sjeleglade for å finne et nytt tallsystem. Spesielt er de begeistret for hvordan de kan fortsette å inkrementere på et tall bare ved å tegne på \u003ccode\u003eI\u003c/code\u003e bakerst! Veldig praktisk for bankoperasjoner og programmering.\u003c/p\u003e\n\n\u003cp\u003eTallsystemet likner på \u003ca href=\"https://no.wikipedia.org/wiki/Romertall\" title=\"\" rel=\"noreferrer noopener\" target=\"_blank\"\u003evanlige romertall\u003c/a\u003e og har følgende sifferverdier:\u003c/p\u003e\n\n\u003cul\u003e\n\u003cli\u003eJ: 10 000\u003c/li\u003e\n\u003cli\u003eU: 5 000\u003c/li\u003e\n\u003cli\u003eL: 1 000\u003c/li\u003e\n\u003cli\u003eE: 500\u003c/li\u003e\n\u003cli\u003eT: 100\u003c/li\u003e\n\u003cli\u003eR: 50\u003c/li\u003e\n\u003cli\u003e3: 10\u003c/li\u003e\n\u003cli\u003eV: 5\u003c/li\u003e\n\u003cli\u003eI: 1\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eTall konstrueres ved å sette sammen sifre, der den totale tallverdien er summen av sifrenes tallverdi. \u003ccode\u003eVII\u003c/code\u003e vil for eksempel bli \u003ccode\u003e5 + 1 + 1 = 7\u003c/code\u003e. Ett eller flere synkende/like store sifre på rad foran et større siffer danner en \u003cem\u003erekke\u003c/em\u003e og et tilhørende \u003cem\u003eavsluttende siffer\u003c/em\u003e. Det \u003cem\u003eavsluttende sifferet\u003c/em\u003e må være større enn alle sifrene i rekka. Sammen kalles dette en gruppe. Tallverdien til slike grupper er tallverdien til det \u003cem\u003eavsluttende sifferet\u003c/em\u003e, minus summen av tallverdiene til sifrene i \u003cem\u003erekken\u003c/em\u003e.\u003c/p\u003e\n\n\u003cpre\u003e\u003ccode class=\"text\"\u003eR33VIE = (R33VI)E = 500 - (50 + 10 + 10 + 5 + 1) = 424\nTUR33VIE = (T)U(R33VI)E = 5000 - (100) + 500 - (50 + 10 + 10 + 5 + 1) = 5324\n3R = (3)R = 50 - (10) = 40\nJULEL = JUL(E)L = 10 000 + 5 000 + 1 000 + 1 000 - (500) = 16 500\n\u003c/code\u003e\u003c/pre\u003e\n\n\u003cul\u003e\n\u003cli\u003eSifre uten tilhørende rekke regnes også som \u003cem\u003eavsluttende sifre\u003c/em\u003e: \u003ccode\u003eR = ()R = 50\u003c/code\u003e\u003c/li\u003e\n\u003cli\u003e\u003cem\u003eAvsluttende sifre\u003c/em\u003e på tvers av tallet skal også være i synkende rekkefølge.\n\n\u003cul\u003e\n\u003cli\u003e\u003ccode\u003eRTR33VIE\u003c/code\u003e er ikke gyldig fordi \u003ccode\u003eT\u003c/code\u003e fra \u003ccode\u003e(R)T\u003c/code\u003e er mindre enn \u003ccode\u003eE\u003c/code\u003e fra \u003ccode\u003e(R33VI)E\u003c/code\u003e.\u003c/li\u003e\n\u003cli\u003e\u003ccode\u003eRTE\u003c/code\u003e er ikke gyldig fordi \u003ccode\u003eT\u003c/code\u003e fra \u003ccode\u003e(R)T\u003c/code\u003e er mindre enn \u003ccode\u003eE\u003c/code\u003e fra \u003ccode\u003e()E\u003c/code\u003e.\u003c/li\u003e\n\u003cli\u003e\u003ccode\u003eVIV\u003c/code\u003e er gyldig fordi \u003ccode\u003eV\u003c/code\u003e fra \u003ccode\u003e()V\u003c/code\u003e ikke er mindre enn \u003ccode\u003eV\u003c/code\u003e fra \u003ccode\u003e(I)V\u003c/code\u003e.\u003c/li\u003e\n\u003c/ul\u003e\u003c/li\u003e\n\u003cli\u003eDet er ingen begrensning på lengden av rekker eller antall like sifre på rad.\u003c/li\u003e\n\u003cli\u003eDet er ingen negative tall.\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eNordpolens nissebank søker vinterjobbere til vinteren LLLU3I3VII og for å bevise at du er kvalifisert må du vise at du behersker tallsystemet. Du er en ivrig aspirerende bankalv som har søkt vinterjobb og oppgaven du må løse for å søke er: Hva er tallverdien til det største gyldige tallet i \u003ca href=\"https://julekalender-backend.knowit.no/challenges/2024-15/files/transaksjoner.txt?disposition=inline\" title=\"\" rel=\"noreferrer noopener\" target=\"_blank\"\u003eden gamle transaksjonslisten\u003c/a\u003e?\u003c/p\u003e\n\n\u003cp\u003eTil litt ekstra hjelp gir bankalvene deg \u003ca href=\"https://julekalender-backend.knowit.no/challenges/2024-15/files/eksempler.txt?disposition=inline\" title=\"\" rel=\"noreferrer noopener\" target=\"_blank\"\u003een liten liste med ytterligere eksempler\u003c/a\u003e.\u003c/p\u003e\n","answer":"70669"},{"door":16,"author":"Hugo Wallenburg","title":"Honk Choo","content":"\u003cp\u003eKugutt-alven vår er atter en gang søvnig. Roen har senket seg over Nordpol-prærien og han har for en gangs skyld et fullstendig fungerende teppe. Men han sliter med å finne et koselig sted å legge seg!\u003c/p\u003e\n\n\u003cp\u003eBakken overalt rundt han er full av stikkete småbusker og rester etter fordums slag og eskapader. Det eneste stedet som er noenlunde bart på bakken er den \u003ca href=\"https://julekalender-backend.knowit.no/challenges/2024-16/files/el-paso_santa-cruz.txt.gz?disposition=inline\" title=\"\" rel=\"noreferrer noopener\" target=\"_blank\"\u003enærliggende forlatte togbanen\u003c/a\u003e, hvor området midt i sporet er for det meste jord med litt sand og litt grus innimellom. Selvfølgelig er det mange sviller igjen som stikker ut etter mange år under åpen himmel, men det skal nok gå fint å finne et koselig sted å sove likevel!\u003c/p\u003e\n\n\u003chr\u003e\n\n\u003cp\u003eKugutt-alven vår har følgende kroppsproporsjoner:\u003c/p\u003e\n\n\u003cpre\u003e\u003ccode\u003ehode: 5\nnakke: 2\noverkropp: 9\nrumpe: 3\nben: 10\n\u003c/code\u003e\u003c/pre\u003e\n\n\u003cp\u003eFilen er et tverrsnitt av togsporet. På første linje i filen er \u003ccode\u003e*\u003c/code\u003e sviller og \u003ccode\u003e\u003c/code\u003e er tomrom. Bakken på togbanen er gitt ved \u003ccode\u003ej\u003c/code\u003e jord, \u003ccode\u003eg\u003c/code\u003e grus og \u003ccode\u003es\u003c/code\u003e sand på linje 2. Se for deg at han sover \u003cem\u003eoppå\u003c/em\u003e filen.\u003c/p\u003e\n\n\u003cp\u003eKugutt-alven vil sove med føttene mot venstre. En tilstrekkelig koselig plass å sove må oppfylle disse kravene:\u003c/p\u003e\n\n\u003cul\u003e\n\u003cli\u003eHan vil ha minst én sville som pute under hodet.\u003c/li\u003e\n\u003cli\u003eHan liker ikke å ha noe trykkende på nakken, ingen sviller der. Selvfølgelig liker han heller ikke sand i nakken!\u003c/li\u003e\n\u003cli\u003eRumpa hans er alltid komfortabel på jord og sand uansett hvor mange sviller. Overkroppen også.\u003c/li\u003e\n\u003cli\u003eHan kan ha opp til én sville under bena som støtte.\u003c/li\u003e\n\u003cli\u003eHan liker ikke grus! Det kan ikke være grus på noen del av underlaget, også under sviller.\u003c/li\u003e\n\u003cli\u003eDersom hele underlaget er jord og det ikke er noen sviller kan han fint sove der også.\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003eHer er et eksempel på et komfortabelt sted langs sporet kugutt-alven kan sove:\u003c/p\u003e\n\n\u003cpre\u003e\u003ccode class=\"text\"\u003e    BBBBBBBBBBRRROOOOOOOOONNHHHHH\n *       *      **     *      * ** **\njjggsssjjssssssjjjjjsssssjjjjjjsjjggggssj\n\u003c/code\u003e\u003c/pre\u003e\n\n\u003cp\u003eHvor mange plasser langs ruten kan Kugutt-alven sove komfortabelt?\u003c/p\u003e\n","answer":"139711"},{"door":17,"author":"Eirik Valen","title":"Vampyrfeber","content":"\u003cp\u003ePå Nordpolen har alvene mange rare juletradisjoner. Noen lager pepperkakehus, andre polerer reinsdyrsko, men en spesiell alv har en litt annerledes hobby. \nElvward Snøllen har hver jul et maraton av alle Twilight-filmene og har derfor blitt fullstendig oppslukt av såkalte vampyrtall. \nNår han ikke pakker gaver eller fyller julestrømper, sitter han i et mørkt hjørne av verkstedet og jakter på mystiske tall med spesielle egenskaper.\u003c/p\u003e\n\n\u003cp\u003eFor de som ikke kjenner til vampyrtall, er dette tall som oppfører seg som en slags matematisk gåte. \nDe har en mørk hemmelighet: det er tall som har minst to sifre og kan deles opp i to mindre tall, kalt \u0026quot;hoggtenner\u0026quot;. Hoggtennene har hver halvparten av antall sifre som originaltallet og inneholder til sammen alle sifrene til orginaltallet. \nProduktet av disse hoggtennene er det originale tallet. Altså om det finnes en \nmåte man kan stokke om alle sifrene i et tall til to nye tall som inneholder nøyaktig de samme sifrene, i hvilken som helst rekkefølge, og som hvis multipliseres sammen blir det orginale tallet, er dette et vampyrtall. \nFor eksempel er \u003ccode\u003e1260\u003c/code\u003e et vampyrtall, fordi det kan deles opp i hoggtennene \u003ccode\u003e21\u003c/code\u003e og \u003ccode\u003e60\u003c/code\u003e – og når disse ganges sammen får vi nettopp \u003ccode\u003e1260\u003c/code\u003e.\u003c/p\u003e\n\n\u003cp\u003eMen det stopper ikke der. Elvward har også oppdaget noe han kaller pseudo-vampyrtall, som er enda mer mystiske. \nDette er en annen form for vampyrtall, og det som er spesielt med disse er at de kan ha en ujevn mengde sifre og kan deles opp i enten to \u003cstrong\u003eeller\u003c/strong\u003e fler hoggtenner som ikke trenger å ha samme antall siffer. \nSå alle vanlige vampyrtall er også pseudo-vampyrtall (som f.eks \u003ccode\u003e1260\u003c/code\u003e over), men blant pseudo-vampyrtallene har vi flere tall i tillegg. For eksempel så er \u003ccode\u003e126\u003c/code\u003eet pseudo-vampyrtall, fordi det kan deles opp som \u003ccode\u003e6 × 21 = 126\u003c/code\u003e.\u003c/p\u003e\n\n\u003cp\u003e\u003ccode\u003e16368\u003c/code\u003e er også et pseudo-vampyrtall, fordi det kan deles opp som \u003ccode\u003e66 × 31 × 8 = 16368\u003c/code\u003e.\u003c/p\u003e\n\n\u003cp\u003eNå trenger Elvward din hjelp. I en gammel bok fant han en lang liste med tall, men han har ikke tid til å finne alle pseudo-vampyrtallene selv – det er tross alt snart julaften! Kan du hjelpe ham med å finne summen av alle pseudo-vampyrtallene i filen \u003ca href=\"https://julekalender-backend.knowit.no/challenges/2024-17/files/tall.txt?disposition=inline\" title=\"\" rel=\"noreferrer noopener\" target=\"_blank\"\u003etall.txt\u003c/a\u003e? \u003c/p\u003e\n","answer":"3004218"},{"door":18,"author":"Hugo Wallenburg","title":"Alvonaccitall","content":"\u003cp\u003eAlvene er, som alle oss andre, fryktelig fascinerte av Fibonaccitall. Deres fremste matte-alv, Alva Lovelace, ser seg spesielt interessert og kommer på en ny sekvens for å ta sin rettmessige plass i Alvematikkens rekker.\u003c/p\u003e\n\n\u003cp\u003eAlvonaccitall tar utgangspunkt i Fibonaccitallene (\u003ccode\u003efib(0) = 0; fib(1) = 1; fib(n) = fib(n-1) + fib(n-2)\u003c/code\u003e), men for hvert \u003ccode\u003en\u003c/code\u003e-te tall i sekvensen delelig på en potens av \u003ccode\u003e5\u003c/code\u003e setter vi inn tall fra starten en alvonacci-sekvens tilhørende den høyeste delelige femmerpotensen. Dette tallet regnes med som tillegg i neste Alvonaccitall. For eksempel for \u003ccode\u003en=5\u003c/code\u003e startes en ny Alvonacci-sekvens som vi plukker fra hver gang \u003ccode\u003en\u003c/code\u003e er delelig på \u003ccode\u003e5\u003c/code\u003e. Dermed er \u003ccode\u003ealvonacci(n=5) == alvonacci(n=0)\u003c/code\u003e og \u003ccode\u003ealvonacci(n=10) == alvonacci(n=1)\u003c/code\u003e, etc. Neste femmerpotens deretter er \u003ccode\u003e25\u003c/code\u003e, så på \u003ccode\u003en=25\u003c/code\u003e starter vi en ny Alvonacci-sekvens for hver gang \u003ccode\u003en\u003c/code\u003e er delelig på \u003ccode\u003e25\u003c/code\u003e, \u003ccode\u003ealvonacci(n=25) == alvonacci(n=0)\u003c/code\u003e, \u003ccode\u003ealvonacci(n=50) == alvonacci(n=1)\u003c/code\u003e, etc. For \u003ccode\u003en\u003c/code\u003e som ikke er delelige på femmerpotenser regner vi som vanlige Fibonaccitall ut ifra de forrige 2 tallene i sekvensen.\u003c/p\u003e\n\n\u003cp\u003eStarten av sekvensen er slik:\u003c/p\u003e\n\n\u003cpre\u003e\u003ccode\u003ealvonacci(n):\n0: 0\n1: 1\n2: 1\n3: 2\n4: 3\n5: 0 (alvonacci(n=0)) # Ny sekvens for 5\n6: 5 (2 + 3 + 0)\n7: 5\n8: 10\n9: 15\n10: 1 (alvonacci(n=1)) # Plukker videre fra 5-sekvensen...\n11: 26 (10 + 15 + 1)\n12: 27\n13: 53\n14: 80\n15: 1 (alvonacci(n=2))\n16: 134 (53 + 80 + 1)\n17: 135\n18: 269\n19: 404\n20: 2 (alvonacci(n=3))\n21: 675 (269 + 404 + 2)\n22: 677\n23: 1352\n24: 2029\n25: 0 (alvonacci(n=0)) # Ny sekvens for 25. Vi plukker ikke fra 5-sekvensen.\n26: 3381 (1352 + 2029 + 0)\n27: 3381\n28: 6762\n29: 10143\n30: 3 (alvonacci(n=4))\n31: 16908 (6762 + 10143 + 3)\n32: 16911\n33: 33819\n34: 50730\n35: 0 (alvonacci(n=5))\n36: 84549 (33819 + 50730 + 0)\n37: 84549\n38: 169098\n39: 253647\n40: 5 (alvonacci(n=6))\n41: 422750 (169098 + 253647 + 5)\n42: 422755\n43: 845505\n44: 1268260\n45: 5 (alvonacci(n=7))\n46: 2113770 (845505 + 1268260 + 5)\n47: 2113775\n48: 4227545\n49: 6341320\n50: 1 (alvonacci(n=1)) # Plukker videre fra 25-sekvensen...\n51: 10568866 (4227545 + 6341320 + 1)\n52: 10568867\n53: 21137733\n54: 31706600\n55: 10 (alvonacci(n=8))\n56: 52844343 (21137733 + 31706600 + 10)\n...\n125: 0 (alvonacci125(n=0)) # Ny sekvens for 125. Vi plukker ikke fra 25- eller 5-sekvensen.\n...\n\u003c/code\u003e\u003c/pre\u003e\n\n\u003cp\u003eHva er de siste 20 sifrene til \u003ccode\u003ealvonacci(5**8 - 1)\u003c/code\u003e?\u003c/p\u003e\n","answer":"21523436543358121125"},{"door":19,"author":"Daniel Johnsen","title":"Dombjelletall","content":"\u003cp\u003eRudolf er et reinsdyr. Det er det liten tvil om, og det vet de aller fleste. Det ikke alle vet er at Rudolf også er et matematisk geni som elsker tall. Og aller mest i hele verden elsker han Dombjelletall.\u003c/p\u003e\n\n\u003cp\u003e\u0026quot;Dombjelletall?\u0026quot;, spør du kanskje. Og det er det ikke rart om du gjør, for dette er Rudolf sin egen oppfinnelse. Og det er svært få andre som vet om dem. De heter dette fordi Rudolf tenker på disse mens han og de andre reinsdyrene leverer julegaver med nissen.\n\u0026quot;Greit det\u0026quot;, tenker du kanskje videre, \u0026quot;men hva er disse dombjelletallene?\u0026quot;.\u003c/p\u003e\n\n\u003cp\u003eJo, hvis f.eks. tallet 3432 gjøres om til sin binære 16 bit representasjon, så ser den slik ut:\u003c/p\u003e\n\n\u003cpre\u003e\u003ccode\u003eTallet 3432:\n0000110101101000\n\u003c/code\u003e\u003c/pre\u003e\n\n\u003cp\u003eDenne representasjonen blir så delt opp i 4 soner. To og to soner skal være like lange som hverandre, og de skal ha en lengde på minst 2, slik:\u003c/p\u003e\n\n\u003cpre\u003e\u003ccode\u003e[[0 0] [0 0] [1 1 0 1 0 1] [1 0 1 0 0 0]]\n[[0 0] [0 0 1 1 0 1] [0 1] [1 0 1 0 0 0]]\n[[0 0] [0 0 1 1 0 1] [0 1 1 0 1 0] [0 0]]\n[[0 0 0 0 1 1] [0 1] [0 1] [1 0 1 0 0 0]]\n[[0 0 0 0 1 1] [0 1] [0 1 1 0 1 0] [0 0]]\n[[0 0 0 0 1 1] [0 1 0 1 1 0] [1 0] [0 0]]\n[[0 0 0] [0 1 1] [0 1 0 1 1] [0 1 0 0 0]]\n[[0 0 0] [0 1 1 0 1] [0 1 1] [0 1 0 0 0]]\n[[0 0 0] [0 1 1 0 1] [0 1 1 0 1] [0 0 0]]\n[[0 0 0 0 1] [1 0 1] [0 1 1] [0 1 0 0 0]]\n[[0 0 0 0 1] [1 0 1] [0 1 1 0 1] [0 0 0]]\n[[0 0 0 0 1] [1 0 1 0 1] [1 0 1] [0 0 0]]\n[[0 0 0 0] [1 1 0 1] [0 1 1 0] [1 0 0 0]]\n\u003c/code\u003e\u003c/pre\u003e\n\n\u003cp\u003eMinst en av disse linjene har 2 like binærsone-par:\u003c/p\u003e\n\n\u003cpre\u003e\u003ccode\u003e[[0 0 0] [0 1 1 0 1] [0 1 1 0 1] [0 0 0]]\n\u003c/code\u003e\u003c/pre\u003e\n\n\u003cp\u003eHer er altså første og fjerde sone lik hverandre, og andre og tredje sone er lik hverandre. Derfor er 3432 et Dombjelletall. Hvor mange Dombjelletall finner du mellom 0 og 65535, altså fra og med 0000 0000 0000 0000 til og med 1111 1111 1111 1111 binært?\u003c/p\u003e\n","answer":"2488"},{"door":20,"author":"Didrik Aalen Pemmer","title":"Festglad Alvesort","content":"\u003cp\u003eJulenissen elsker to ting: sortering og festing. Derfor har han kombinert begge deler i en ny sorteringsalgoritme han kaller Festglad Alvesort. For å forberede seg til julaften, skal han sortere alvene sine etter høyde ved hjelp av denne algoritmen. På denne måten kan han kose seg med både sortering og fest!\u003c/p\u003e\n\n\u003cp\u003eHvordan fungerer Festglad Alvesort? Festglad Alvesort starter som en vanlig Alvesort:\u003c/p\u003e\n\n\u003cblockquote\u003e\n\u003cp\u003eDu er en sorteringsalv.\u003cbr\u003e\nDu stiller deg mellom den første og andre alven i rekken vendt mot slutten av rekken.\u003cbr\u003e\nFrem til du ikke har noen alver foran deg:\u003cbr\u003e\n\u0026emsp;Dersom du har en alv bak deg og alven foran deg er lavere enn den bak deg:\u003cbr\u003e\n\u0026emsp;\u0026emsp;Få dem til å bytte plass.\u003cbr\u003e\n\u0026emsp;\u0026emsp;Flytt deg én alv bakover.\u003cbr\u003e\n\u0026emsp;Ellers:\u003cbr\u003e\n\u0026emsp;\u0026emsp;Flytt deg én alv forover.\u003cbr\u003e\nHurra! Alle alvene er sortert.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\u003cp\u003eDu har kanskje merket at Alvesort inneholder ikke en eneste fest. Derfor har nissen lagt til følgende regler for Festglad Alvesort:\u003c/p\u003e\n\n\u003cblockquote\u003e\n\u003cp\u003eEtter hver syvende alv du bytter plass på (men før du flytter deg bakover) ber nissen deg arrangere en fest!\u003cbr\u003e\nDe neste fem alvene foran deg i rekken får feste til de er tilfredse, og når de er ferdige stiller de seg i omvendt rekkefølge fra slik de startet.\u003cbr\u003e\nDeretter fortsetter du som vanlig Alvesort fram til neste fest.\u003c/p\u003e\n\u003c/blockquote\u003e\n\n\u003cp\u003eDin oppgave: Hjelp nissen med å implementere Festglad Alvesort for å sortere \u003ca href=\"https://julekalender-backend.knowit.no/challenges/2024-20/files/usorterte_alver.txt?disposition=inline\" title=\"\" rel=\"noreferrer noopener\" target=\"_blank\"\u003edisse alvene\u003c/a\u003e (\u003ccode\u003e\u0026lt;navn\u0026gt; \u0026lt;høyde\u0026gt;\u003c/code\u003e) etter høyde. Når sorteringen er ferdig skal du returnere navnet på alven som var med på flest fester og antall fester vedkommende var med på formatet \u003ccode\u003enavn,antall_fester\u003c/code\u003e\u003c/p\u003e\n\n\u003cp\u003eFor eksempel for alvene i eksempelet under så vil svaret være \u003ccode\u003eLuthien,5\u003c/code\u003e\u003c/p\u003e\n\n\u003cpre\u003e\u003ccode\u003eLegolas 75\nTauriel 84\nElrond 45\nGaladriel 59\nThranduil 69\nArwen 99\nHaldir 76\nGlorfindel 46\nFinrod 204\nErestor 60\nCelebrimbor 99\nFingolfin 66\nGil-Galad 97\nLuthien 116\nFeanor 129\n\u003c/code\u003e\u003c/pre\u003e\n","answer":"elrond_128,8746"},{"door":21,"author":"Lars Sørlie","title":"Hjelp, vi er tomme for grøtris!","content":"\u003cp\u003eFor en stund siden bestemte Nissen seg, med hjelp fra den sørpolske teknologien BakstGPT, for å kutte risgrøt fra alvenes matpause for å stramme inn kostnader. Alvene tålererer dette særdeles dårlig og nå har de nådd bristepunktet og ser seg nødt til å streike for å få tilbake grøten sin.\nDet er midt i julestria og Nissen klarer ikke produsere alle gavene uten billig alvekraft. Han ser seg nødt til å gi alvene det de vil ha (han kan heller straffe dem senere). Alvene har kun ett krav: Grøt. Grøten skal såklart være laget av \u003cstrong\u003eNordPolar-grøtris\u003c/strong\u003e, en eksklusiv grøtrissort som kun selges i Norge.\u003c/p\u003e\n\n\u003cp\u003eNissen trodde han var ferdig med å servere risgrøt, så lagrene på Nordpolen er helt tomme for grøtris. Han må kaste seg rundt og kjøpe all grøtrisen han kan få hendene sine på og finner til hjelp \u003cstrong\u003een liste med koordinater til hver butikk og deres respektive grøtrisbeholdning\u003c/strong\u003e (\u003ccode\u003ebutikker.csv\u003c/code\u003e). I sin hast overser han noe kritisk viktig: Det er såklart bare butikkene i Norge som selger NordPolar-grøtris! Han holder på å fortvile, for hvordan kan han vel både finne hvilke av butikkene som er i Norge og nå dem alle i tide til jul?\u003c/p\u003e\n\n\u003cp\u003eKan du hjelpe? Alva Lovelace er opptatt med å lage de siste oppgavene til årets julekalender, men for å bistå litt finner hun i alvearkivet en \u003cstrong\u003efil med alle norges landmasser\u003c/strong\u003e (\u003ccode\u003enorge.geojson\u003c/code\u003e). Med denne filen og nissens liste av butikker og deres grøtris, kan du hjelpe han finne den raskeste ruten for å kjøpe med seg all tilgjengelig NordPolar-grøtris? Han trenger ikke stoppe der det ikke er grøtris igjen, og han stopper ikke på butikker som ikke selger NordPolar-grøtris. Han starter og stopper på Nordpolen.\u003c/p\u003e\n\n\u003cp\u003eDet vil være to svar, samme rute med speilet rekkefølge; Oppgi den ruten som er tidligst innom Jan Mayen. Alle punkter skal ha tre desimaler, og skal rundes ned \u003cem\u003emot null\u003c/em\u003e. Eksempelvis: \u003ccode\u003e(90.000,0.000),(59.917,10.738),(59.663,10.628),(90.000,0.000)\u003c/code\u003e\u003c/p\u003e\n\n\u003cp\u003e\u003ca href=\"https://julekalender-backend.knowit.no/challenges/2024-21/files/gr%C3%B8tris.tgz?disposition=inline\" title=\"\" rel=\"noreferrer noopener\" target=\"_blank\"\u003eDette filarkivet\u003c/a\u003e inneholder \u003ccode\u003ebutikker.csv\u003c/code\u003e og \u003ccode\u003enorge.geojson\u003c/code\u003e.\u003cbr\u003e\nAlvene lagrer koordinatene sine som \u003ccode\u003e(breddegrader, lengdegrader)\u003c/code\u003e. GeoJSON-formatet bruker \u003ccode\u003e(lengdegrader, breddegrader)\u003c/code\u003e.\u003c/p\u003e\n","answer":"(90.000,0.000),(70.967,-8.679),(62.484,7.723),(61.636,8.312),(59.952,10.751),(61.362,9.667),(61.595,9.760),(61.915,9.852),(67.526,12.127),(71.169,25.784),(78.219,15.616),(90.000,0.000)"},{"door":22,"author":"Sander Krøglid","title":"Pepperkakeformer","content":"\u003cp\u003eNordpolens Rikskringkasting har laget et spill, \u003cstrong\u003ePepperkakeformer\u003c/strong\u003e, som har gått viralt på nordpolen.\u003c/p\u003e\n\n\u003cp\u003eSpillbrettet er et tiltenkt stekebrett med pepperkaker arrangert i et rutenett. Spillet går ut på at man skal eliminere alle pepperkakene på brettet ved å gjentatte ganger fjerne alle pepperkaker som tilhører samme \u003cem\u003egruppe av like former\u003c/em\u003e. Etter hver gruppe fjernes flyttes de gjenværende pepperkakene nedover mot bunnen av brettet for å fylle tomrommet. Målet med spillet er å tømme brettet for alle pepperkaker på færrest mulig trekk.\u003c/p\u003e\n\n\u003cp\u003eLøsning av et brett på 3x3 kan for eksempel se slik ut:\u003c/p\u003e\n\n\u003cpre\u003e\u003ccode\u003e🤎🦌🧸    ❌🦌🧸    ❌❌❌    ❌❌❌    ❌❌❌\n🤎🧸🧸 -\u0026gt; ❌🧸🧸 -\u0026gt; ❌🦌❌ -\u0026gt; ❌❌❌ -\u0026gt; ❌❌❌\n🤎🦌🎄    ❌🦌🎄    ❌🦌🎄    ❌❌🎄    ❌❌❌\n\u003c/code\u003e\u003c/pre\u003e\n\n\u003cp\u003eHer har vi først eliminert pepperkakehjertene, så pepperkakebjørnene. Etter å ha fjernet pepperkakebjørnene \u0026quot;faller\u0026quot; pepperkakereinsdyret ned et hakk slik at det blir en gruppe med pepperkakereinsdyret på bunnen. Deretter er det to trekk til for å tømme brettet. Dette brettet kan løses på 4 trekk.\u003c/p\u003e\n\n\u003cp\u003eSpillen Spillberg og alvevennegjengen hans elsker å spille Pepperkakeformer, men vennene til Spillen er mye flinkere enn han. Dette har Spillen lyst til å gjøre noe med, så han ber deg lage et program for å finne den beste løsningen slik at han alltid kan vinne over vennene sine. Programmet ditt må klare å løse alle brettene (av varierende størrelse) i \u003ca href=\"https://julekalender-backend.knowit.no/challenges/2024-22/files/stekebrett.txt?disposition=inline\" title=\"\" rel=\"noreferrer noopener\" target=\"_blank\"\u003edenne tekstilen\u003c/a\u003e.\u003c/p\u003e\n\n\u003cp\u003eHva er færreste totale antall trekk for å løse alle brettene han gir deg?\u003c/p\u003e\n","answer":"228"},{"door":23,"author":"Gaute Rauboti","title":"Lekemaskinscannernedetidspetakkel","content":"\u003cp\u003ePå Nordpolen lever alle alver i harmoni, bortsett fra når lekemaskinen på Juleverkstedet slår seg vrang. De er absolutt kritisk avhengige av å vite hvilken leke som er neste til å komme ut av maskinen, ellers går de fra vettet.\u003c/p\u003e\n\n\u003cp\u003eAlvemekanikere er heldigvis dyktige, så lekemaskinen er nok raskt oppe og går igjen. Kan du i mellomtiden hjelpe å finne hva neste leke skal være, slik at alvene kan slappe litt av? Det eneste du har er \u003ca href=\"https://julekalender-backend.knowit.no/challenges/2024-23/files/lekescan.txt?disposition=inline\" title=\"\" rel=\"noreferrer noopener\" target=\"_blank\"\u003edenne datafilen lekescanneren gir deg\u003c/a\u003e. Ingen vet hvordan datafilen fungerer, bare at den er ment til å vises av lekescannerprosjektøren på lekescannerprojektoren som er koblet til lekescanneren ved siden av lekemaskinen i lekemaskinfabrikken.\u003c/p\u003e\n\n\u003cp\u003eHva er neste leke?\u003c/p\u003e\n","answer":"sykkel"},{"door":24,"author":"🧝🏻‍♀️ Alle alvene 🧝🏻‍♂️","title":"Ekstase av Gull","content":"\u003cp\u003eNissen har glemt passordet til hvelvet sitt der oppbevarer han alt gullet han bruker til å betale alvene for sin overtidsinnsats i juletiden. Nettopp for slike situasjoner har han skrevet passordet på en Post-it, men den er blitt revet og det eneste som kan synes av passordet er starten: \u003ccode\u003eDa-\u003c/code\u003e.\u003c/p\u003e\n\n\u003cp\u003eKugutt-alven til unnsetning! Kugutt-alven har hørt om nissens uhell og forteller om sine reiser som etter noen harde netter og usannsynlige soveunderlag kulminerte i en meksikansk standoff mellom han og Krampus og Grinchen. Det viser seg at Grinchen hadde i sin besittelse en fil med nissens elektroniske kommunikasjon - Grinchen har hacket nissen! Med Grinchen ute av bildet er det ikke lenger en trussel, men inneholder filen passordet til nissen? Kugutt-alven lover nissen å finne passordet hans i bytte mot halvparten av gullet i hvelvet. Nissen har ikke annet valg enn å godta.\u003c/p\u003e\n\n\u003cp\u003e\u003ca href=\"https://julekalender-backend.knowit.no/challenges/2024-24/files/kryptert.txt?disposition=inline\" title=\"\" rel=\"noreferrer noopener\" target=\"_blank\"\u003eGrinchens fil\u003c/a\u003e inneholder utsnitt av nissens tastetrykk, kommunikasjon, søk og nettleserhistorie i kryptert format. Kugutt-alven vet ikke hvordan å løse opp krypteringen, men erindrer et av Grinchens notater hvor det var skrevet at han krypterer dataen sin med \u003ccode\u003eXOR\u003c/code\u003e, hvor hver byte i den krypterte dataen er den byten på samme plass i den ukrypterte dataen \u003ccode\u003eXOR\u003c/code\u003e-et med den foregående byten i den ukrypterte dataen. Videre er det kjent at teksten etter dekryptering er i \u003ccode\u003eutf-8\u003c/code\u003e-format.\u003c/p\u003e\n\n\u003cp\u003eFinner du nissens passord?\u003c/p\u003e\n","answer":"da-var-det-atter-en-gang-på-tide-å-takke-for-nå-og-si-at-vi-ønsker-dere-en-fortreffelig-jul-og-takk-for-at-dere-deltok-og-vi-håper-å-se-dere-igjen-neste-gang!"}]